testCases/Feindt/ZPG_250.Langel2017/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      solver           GAMG;
      smoother         GaussSeidel;
      tolerance        1e-6;
      relTol           0.01;
      minIter 1;
    }

    "(h|U|k|omega|gammaInt|gamma|ReThetat|Ar)"
    {
      solver           PBiCGStab;
      preconditioner   DILU;
      tolerance        1e-8;
      relTol           0.001;
      minIter 1;
    }
}

SIMPLE
{
    consistent  yes;
    
    residualControl.DISABLED
    {
        p               1e-5;
        U               1e-6;
	"(k|omega|gammaInt|ReThetat|Ar)" 1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p               1.; 
    }
    equations
    {
        U                     0.7; 
	"(k|omega)"           0.7;
	"(gammaInt|ReThetat)" 0.7;
	Ar                    0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
